{
  "name": "Hossein Margani",
  "gender": "He/Him",
  "title": "Software Engineer",
  "details": {
    "location": "London, UK",
    "email": "hossein@margani.dev",
    "website": "https://margani.dev/",
    "meeting": "https://calendly.com/margani/",
    "github": "https://github.com/margani/",
    "linkedIn": "https://www.linkedin.com/in/hosseinmargani/"
  },
  "output": {
    "fileName": "Hossein-Margani-CV.pdf"
  },
  "summary": [
    "Dynamic and highly technical Senior DevOps Engineer with a strong software engineering background and over seven years of hands-on experience building, automating, and operating secure, scalable, cloud-native platforms on Azure. Skilled in modern Infrastructure as Code, container orchestration, and CI/CD automation, with a track record of driving infrastructure reliability, improving engineering workflows, and enabling efficient delivery across teams."
  ],
  "skills": [
    "Deep experience designing and operating Azure infrastructure, including cost-optimisation, security, networking, and large-scale architecture.",
    "Expert in Infrastructure as Code using Pulumi (C#), Bicep, and ARM templates, delivering reproducible and automated cloud environments.",
    "Expert in building CI/CD pipelines using Azure Pipelines, GitHub Actions, and Octopus Deploy.",
    "Strong scripting capability in PowerShell, Bash, and Python for automation, tooling, and pipeline orchestration.",
    "Skilled in managing AKS clusters, Helm charts, container image pipelines, and platform maintenance (patching, upgrades, image pipelines).",
    "Experience with Azure Image Builder and container image lifecycle management.",
    "Strong background in C#, .NET Core, SQL Server, and REST API development.",
    "Solid full-stack engineering foundation enabling effective collaboration with development teams.",
    "Experience embedding security best practices into CI/CD pipelines, Azure resources, networking, and cloud governance.",
    "Familiar with WAF, private endpoints, security assessments, and enterprise-grade compliance practices."
  ],
  "history": {
    "employment": [
      {
        "title": "Senior DevOps Engineer",
        "employer": "WTW",
        "location": "Reigate, UK",
        "startDate": "June 2024",
        "description": [
          "Learned and adopted Pulumi with C#, implementing multiple infrastructure projects for the Unify teams and modernising existing cloud environments.",
          "Maintained and improved cloud infrastructure by performing monthly AKS upgrades, patching Windows VM images, and updating Windows/Linux Docker images.",
          "Designed and implemented infrastructure changes and new services using Pulumi and C#, ensuring scalability, reliability and clean configuration practices.",
          "Planned and executed the migration from Packer to Azure Image Builder for VM image creation, improving consistency, automation, and build quality.",
          "Authored and maintained pipeline templates and PowerShell scripts, contributed actively to the DevOps Guild across the organisation, documented infrastructure usage for developers, supported client-raised tickets, and participated in on-call rotations."
        ]
      },
      {
        "title": "Senior DevOps Engineer",
        "employer": "Aqovia",
        "location": "London, UK",
        "startDate": "Aug 2022",
        "endDate": "June 2024",
        "description": [
          "Led two DevOps teams, providing technical direction, architectural guidance, and promoting best practices across all projects.",
          "Architected and delivered secure, scalable Azure infrastructure solutions closely aligned with development and business needs.",
          "Embedded DevSecOps practices by integrating security controls into CI/CD pipelines and enforcing infrastructure security standards.",
          "Optimised DevOps workflows by improving automation, introducing new tooling, and refining CI/CD pipelines for reliability and performance.",
          "Mentored engineers and fostered a collaborative culture focused on continuous improvement and cross-team knowledge sharing."
        ]
      },
      {
        "title": "DevOps Engineer",
        "employer": "Aqovia",
        "location": "London, UK",
        "startDate": "Oct 2018",
        "endDate": "Aug 2022",
        "description": [
          "Designed and implemented ARM/Bicep templates and automated CI/CD pipelines using Azure Pipelines (YAML) for multiple environments.",
          "Managed AKS clusters, orchestrated deployments with Helm v3 charts, and automated cluster patching and version upgrades.",
          "Automated provisioning of test environments using Chef, Vagrant, Azure Pipelines and Octopus Deploy.",
          "Developed dashboards and runbooks to visualise pipeline health, streamline operational tasks, and accelerate complex organisational processes.",
          "Implemented secure networking patterns including private endpoints, WAF policies, and SQL vulnerability assessments."
        ]
      },
      {
        "title": "Senior Software Engineer",
        "employer": "Aqovia",
        "location": "London, UK",
        "startDate": "Oct 2017",
        "endDate": "Oct 2018",
        "description": [
          "Engaged in productive collaboration with the team to comprehend requirements and business specifications effectively.",
          "Engaged in full-stack development using .NET, lit-html, Redux, with a focus on Test-Driven Development",
          "Designed and sustained web application architecture, microservices, and contemporary component-based user interfaces."
        ]
      },
      {
        "title": "Senior Software Engineer",
        "employer": "Geeks Ltd",
        "location": "London, UK",
        "startDate": "Mar 2016",
        "endDate": "Sep 2017"
      },
      {
        "title": "Software Engineer",
        "employer": "PTC",
        "location": "Mashhad, Iran",
        "startDate": "Feb 2014",
        "endDate": "Jun 2015"
      },
      {
        "title": "Software Developer",
        "employer": "GoldNet Engineering Group",
        "location": "Mashhad, Iran",
        "startDate": "Jun 2010",
        "endDate": "Feb 2014"
      },
      {
        "title": "Software Developer",
        "employer": "Moshaveran Meshcut Shargh",
        "location": "Mashhad, Iran",
        "startDate": "May 2006",
        "endDate": "May 2010"
      }
    ],
    "education": [
      {
        "school": "Islamic Azad University of Mashhad",
        "degree": "M.Sc.",
        "field": "Computer Software Engineering",
        "location": "Mashhad, Iran",
        "description": "Devised an enhanced algorithm for image encryption using cellular automata and chaos theory"
      },
      {
        "school": "Sadjad Institute of Higher Education",
        "degree": "B.Sc.",
        "field": "Computer Software Engineering",
        "location": "Mashhad, Iran",
        "description": "Engineered an algorithm for fast detection of glass particles in glass containers using C# and MATLAB"
      }
    ]
  }
}


