{
  "name": "Hossein Margani",
  "gender": "He/Him",
  "title": "Software Engineer",
  "details": {
    "location": "London, UK",
    "email": "hossein@margani.dev",
    "website": "https://margani.dev/",
    "meeting": "https://calendly.com/margani/",
    "github": "https://github.com/margani/",
    "linkedIn": "https://www.linkedin.com/in/hosseinmargani/"
  },
  "output": {
    "fileName": "Hossein-Margani-CV.pdf"
  },
  "summary": [
    "Dynamic and achievement-focused Senior DevOps Engineer with over four years of hands-on experience in designing, implementing, and maintaining secure and efficient cloud infrastructures and a solid foundation in software development."
  ],
  "skills": [
    "Demonstrated expertise in Azure infrastructure, excelling in cost estimation, architectural design, and implementation. Proven success in optimizing cloud resources to ensure cost-effectiveness while maintaining high-performance and scalability.",
    "Expert in orchestrating CI/CD pipelines using Octopus Deploy, Azure Pipelines and GitHub Actions, ensuring efficient and reliable delivery of software solutions with a focus on automation and continuous integration.",
    "Expert in PowerShell, Bash and Python scripting for efficient process automation",
    "Expert in C#, .NET Core, SQL Server, RESTful API",
    "Expert in crafting and managing Infrastructure as Code solutions using ARM and Bicep templates, ensuring scalable, efficient, and automated deployment of cloud resources."
  ],
  "history": {
    "employment": [
      {
        "title": "Senior DevOps Engineer",
        "employer": "WTW",
        "location": "Reigate, UK",
        "startDate": "June 2024",
        "description": [
        ]
      },
      {
        "title": "Senior DevOps Engineer",
        "employer": "Aqovia",
        "location": "London, UK",
        "startDate": "Aug 2022",
        "endDate": "June 2024",
        "description": [
          "Spearheaded two separate DevOps teams, providing strategic direction and technical guidance in alignment with project goals and industry best practices.",
          "Led the development of Azure infrastructure solutions, ensuring robust, scalable, and secure environments for optimal application deployment and performance.",
          "Fostered a collaborative and innovative team culture, overseeing the work of DevOps teams to achieve project objectives effectively.",
          "Provided mentorship and support to team members, fostering skill development and knowledge sharing within the teams.",
          "Leveraged expert knowledge of Azure infrastructure to architect, implement, and maintain secure cloud environments, optimizing resources for cost-effectiveness and scalability.",
          "Collaborated closely with developers to understand project requirements, translating them into effective infrastructure solutions that supported seamless development and deployment workflows.",
          "Championed and embedded DevSecOps practices within the teams, integrating security into the development and deployment pipelines.",
          "Ensured the adoption of security best practices, conducting regular assessments, and implementing measures to enhance the overall security posture of the projects.",
          "Encouraged a culture of continuous improvement, regularly evaluating and enhancing the efficiency of CI/CD pipelines and infrastructure provisioning processes.",
          "Introduced innovative solutions and tools to streamline development workflows, increase automation, and improve overall project delivery timelines."
        ]
      },
      {
        "title": "DevOps Engineer",
        "employer": "Aqovia",
        "location": "London, UK",
        "startDate": "Oct 2018",
        "endDate": "Aug 2022",
        "description": [
          "Crafted and maintained scripts and templates for automating CI/CD pipelines in Azure Pipelines (YAML).",
          "Designed and maintained ARM/Bicep templates for provisioning Azure resources for environments.",
          "Orchestrated container clusters using Azure Kubernetes and Helm v3 charts and Docker containers for deploying external API sandboxes.",
          "Established an Azure Pipelines-based pipeline for patching and updating Azure Kubernetes clusters to the latest version.",
          "Provided expert consultation to the development team on optimizing Azure cloud services and implementing efficient DevOps practices. Collaborated with team members to implement robust CI/CD pipelines, ensuring seamless integration of new features and enhancements.",
          "Automated provisioning of test environments using Chef, Vagrant and Octopus Deploy.",
          "Streamlined nightly deployment of pipelines to test environments using Azure Pipelines (YAML) and Azure Automation Accounts (PowerShell), complemented by the creation of an informative dashboard in Azure DevOps showcasing the status of all pipeline runs.",
          "Developed an Octopus Deploy Runbook to automate and orchestrate a complex, cross-team process within the client's organization, significantly reducing the timeline from a month to less than a week.",
          "Set up and configured private endpoints for Azure services, enhancing security by restricting resource access to designated networks and subnets.",
          "Managed and sustained WAF policies for Azure Front Door, ensuring robust security measures for front-end applications and APIs.",
          "Established and upheld SQL vulnerability assessments for Azure SQL databases, offering insightful recommendations to the development team for prompt issue resolution.",
          "Set up and configured deployment slots for Azure Function Apps, enabling zero-downtime deployments for microservices and APIs."
        ]
      },
      {
        "title": "Senior Software Engineer",
        "employer": "Aqovia",
        "location": "London, UK",
        "startDate": "Oct 2017",
        "endDate": "Oct 2018",
        "description": [
          "Engaged in productive collaboration with the team to comprehend requirements and business specifications effectively.",
          "Engaged in full-stack development using .NET, lit-html, Redux, with a focus on Test-Driven Development",
          "Designed and sustained web application architecture, microservices, and contemporary component-based user interfaces."
        ]
      },
      {
        "title": "Senior Software Engineer",
        "employer": "Geeks Ltd",
        "location": "London, UK",
        "startDate": "Mar 2016",
        "endDate": "Sep 2017"
      },
      {
        "title": "Software Engineer",
        "employer": "PTC",
        "location": "Mashhad, Iran",
        "startDate": "Feb 2014",
        "endDate": "Jun 2015"
      },
      {
        "title": "Software Developer",
        "employer": "GoldNet Engineering Group",
        "location": "Mashhad, Iran",
        "startDate": "Jun 2010",
        "endDate": "Feb 2014"
      },
      {
        "title": "Software Developer",
        "employer": "Moshaveran Meshcut Shargh",
        "location": "Mashhad, Iran",
        "startDate": "May 2006",
        "endDate": "May 2010"
      }
    ],
    "education": [
      {
        "school": "Islamic Azad University of Mashhad",
        "degree": "M.Sc.",
        "field": "Computer Software Engineering",
        "location": "Mashhad, Iran",
        "description": "Devised an enhanced algorithm for image encryption using cellular automata and chaos theory"
      },
      {
        "school": "Sadjad Institute of Higher Education",
        "degree": "B.Sc.",
        "field": "Computer Software Engineering",
        "location": "Mashhad, Iran",
        "description": "Engineered an algorithm for fast detection of glass particles in glass containers using C# and MATLAB"
      }
    ]
  }
}
